/* do ~ while문 */

'use strict';

// log => function

/* 
do {
    반복 실행 블럭;
} while (조건식(반복));
*/

// 10 ~ 17
let x = 9;

do {
    x++;
    console.log(x);
} while(x < 17);

/* ==================================================================================================== */

/* 
do {
    반복 실행 블럭;
    if (조건식) break;
    증감식;
} while (1); => while 무한루프를 쓰기 위해서는 조건식에 true(1) 대입해야함에 주의 / *1이 아닌 true값임에 주의
*/

// 10 ~ 17
let i = 9;

do {
    i++;
    if (i >= 18) break;
    console.log(i);
} while(1);

/* ==================================================================================================== */