'use strict';

let max = 0, min = 100;
let sc;

for (let i = 0; i < 5; i++) {
    sc = +prompt('점수 입력: ');

    if (sc > max) {
        max = sc;
    }
    
    if (sc < min) {
        min = sc;    
    } 
    // if 조건문이 단식(구하는 값이 하나일 때)일 경우 '{}(중괄호)'생략 가능
    // ex)) if (sc > max) max = sc;
    // ex)) if (sc < min) min = sc;
}

alert(`최대값: ${max}, 최소값: ${min}`);

/* ==================================================================================================== */

/* for (let i = 0; i < 5; i++) {
    sc =+prompt('점수 입력: ');

    if (sc == 0 || sc == 100) {
        max = sc;
    }
} */

// 위와 같은 식으로 사용하지 않음 추후에 배열을 배우면 위와 같은 식 이용 가능

/* ==================================================================================================== */

/* 'use strict';

console.log(Math.max(70, 50, 80, 100));
console.log(Math.min(70, 50, 80, 100)); */

/* ==================================================================================================== */

/* let max = 0, min = 100;
let stNum;
let sc;

stNum = +prompt('학생 수: ')

for (let i = 0; i < stNum; i++) {
    sc = +prompt('점수 입력: ');

    max = Math.max(sc, max);
    min = Math.min(sc, min);
}

alert(`최대값: ${max}, 최소값: ${min}`); */

// 자바스크립트에서 자체적으로 최대값 | 최소값 구하는 식을 제공하지만,
// 최대값 | 최소값 구하는 식의 기본 이해를 필요로 하기에 첫 번째 식 활용 추천
/* ==================================================================================================== */