'use strict';

let n1, n2;
let tot = 0;

// n1 = 5;
// n2 = 10;

n1 = +prompt('숫자 입력1: ');
n2 = +prompt('숫자 입력2: ');

if (n1 > n2) {
    // t = n1;
    // n1 = n2;
    // n2 = t;

    let t = n1;
    n1 = n2, n2 = t;
}

for (let i = n1; i <= n2; i++) {
    tot += i;
}

alert(`${n1}부터 ${n2}까지의 합: ${tot}`);

/* ==================================================================================================== */

/* 
교환(Swapping): 

n1 = 5
n2 = 10

t = n1 -> t = n1(5)
n1 = n2 -> n1 = n2(10)
n2 = t -> n2 = t(5)

=> n1 = 10
   n2 = 5
 */