/* < 반복문 > */

'use strict';

// for (초기식; 조건식(반복); 증감식) {
//     반복 실행 블럭;
// }

//   >  |  >=  |   <  |  <=
// 초과 | 이상 | 미만 | 이하

// for (let i = 0; i < 10; i++) {         // 초기식 => 조건식 => 반복 실행 블럭 => 증감식
//                                        //        => 조건식 => 반복 실행 블럭 => 증감식
//     console.log(i);                    // 목적하는 식(구하는 식) 
// }

/* ==================================================================================================== */

// 반복(회전)이 결정되기 위한 조건:
// 1. 처음
// 2. 종료
// 3. 일정한 규칙

/* ==================================================================================================== */

// 1 ~ 12
// for (let i = 1/* <현재> */; i < 13;) {
//     console.log(i); /* <현재> */
//     i++; /* <미래> */
// }

// x >= 4: 4 5 6 7 8 9
// x < 4: 3 2 1 0 -1 


//   >  |  >=  |   <  |  <=
// 초과 | 이상 | 미만 | 이하
// 4초과 => x > 4
// 양수: + => 초과, 이상 || 음수: - => 미만, 이하

// 10 ~ 20
// for (let i = 10/* 현재 */; i < 21;/* 미래 */ ) {         
//     console.log(i);     // 현재
//     i++;               
// }

// 초기식: 시작 // 조건식: 끝
// -4 ~ -11
// for (let i = -3/* 과거 */; i > -11;/* 현재 */) {         
//     i--;               
//     console.log(i);     // 현재
// }

// 식을 짜써 컴퓨터 계산하게끔 해주는게 역할
// 계산만 하는 역할

/* ==================================================================================================== */

// 7 ~ 15
// for (let i = 6/* 과거 */ ; ;) {
//     i++;         
//     if (i >= 16) break; /* 미래 */
//     console.log(i); // 현재
// }

// -44 ~ -53
// for (let i = -43; ;) {
//     i--;         
//     if (i <= -54) break;
//     console.log(i);
// }

// 10 ~ 18
// for (let i = 10; ;) {
//     console.log(i);
//     if (i >= 18) break;
//     i++;         
// }

// -3 ~ 8
// for (let i = -3/* 현재 */; ;) {
//     i++;            // 증감식 = 시점을 변경시켜주는 녀석
//     if (i >= 9) break; 
//     console.log(i); // 현재
// }




/* ==================================================================================================== */

// while 조건식 생략 불가

// while (조건식(반복)) { <= while 무한루프를 쓰기 위해서는 조건식에 true(1) 대입해야함에 주의
//     반복 실행 블럭;
// }

/* ==================================================================================================== */

// let result = '9'

// console.log(String(result).length);

// 행 => 열로 구성
// 열 => 행으로 구성

/* for (let i = 1, v = 1; i <= 5; i++) {
    for (let j = 1; j <= 5; j++) {
        document.write(`${String(v).length >= 2 ? '' : '&nbsp;'}${v++} `);
    }
    document.write('<br>');
} */

/* ==================================================================================================== */

/* for (let i = 1; i <= 5; i++) {
    for (let j = 1; j <= 6 - i; j++) {
        document.write(`* `);
    }
    document.write('<br>');
} */

/* ==================================================================================================== */

/* for (let i = 1; i <= 5; i++) {
    for (let j = 1; j <= i; j++) {
        document.write(`* `);
    }
    document.write('<br>');
} */

/* ==================================================================================================== */

/* let line;

line = +prompt('줄 수 입력:');

for (let i = 1, st, ed, m = (line + 1) / 2; i <= line; i++) {

    if (i <= m) {
        st = (m + 1) - i, ed = i + (m - 1);
    } else {
        st = i - (line - m), ed = (line + m) - i;
    }

    for (let j = 1; j <= ed; j++) {
        if (j < st) {
            document.write('&nbsp;&nbsp');
        } else {
            document.write(`* `);
        }
    }
    document.write('<br>');
} */

/* ==================================================================================================== */

let line;

line = +prompt('줄 수 입력:');

for (let i = 1, st, ed, m = (line + 1) / 2; i <= line; i++) {

    if (i <= m) {
        st = i, ed = (line + 1) - i;
    } else {
        st = (line + 1) - i, ed = i;
    }

    for (let j = 1; j <= ed; j++) {
        if (j < st) {
            document.write('&nbsp;&nbsp');
        } else {
            document.write(`* `);
        }
    }
    document.write('<br>');
}