'use strict';

/* let n1, n2, sc1, sc2;
let tot = 0;

n1 = +prompt('점수1 입력: ');
n2 = +prompt('점수2 입력: '); */

/* if (n1 <= n2) {
    for (let n = n1; n <= n2; n++) {
        tot += n;
    }
    alert(`${n1}부터 ${n2}까지의 합: ${tot}`);
} else {
    for (let n = n2; n <= n1; n++) {
        tot += n;
    }
    alert(`${n2}부터 ${n1}까지의 합: ${tot}`);
} */

/* ==================================================================================================== */

// `${n1 <= n2 ? alert(`${n1}부터 ${n2}까지의 합: ${tot}`) : alert(`${n2}부터 ${n1}까지의 합: ${tot}`)}`;

/* ==================================================================================================== */

let min, max;
let n1, n2;
let tot = 0;

n1 = +prompt('점수1 입력: ');
n2 = +prompt('점수2 입력: ');

if (n1 > n2) {
    min = n2, max = n1;
    
} else {
    min = n1, max = n2;
}

for (let n = min; n <= max; n++) {
    tot += n;
}

alert(`${min}부터 ${max}까지의 합: ${tot}`);